# pandas 
- pandas is a fast, powerful, flexible and easy to use open source data analysis and data manipulation library built on top of the Python programming language.
- ref: [https://pandas.pydata.org/ ](https://pandas.pydata.org/docs/user_guide/10min.html)

In [17]:
!pip install pandas -q

In [1]:
# how toread thse gudes in pandas 

import pandas as pd 
pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

   A  B
0  1  4
1  2  5
2  3  6

In [2]:
# 10 minutes to pandas  

import pandas as pd 
import numpy as np

In [3]:
# Bascu data structure in pandas 
s = pd.Series([1, 3, 5, np.nan, 6, 8])
print(s)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.788254  0.242065 -0.384205  0.204724
2013-01-02  0.079479  1.164236 -1.127307 -0.299012
2013-01-03  0.822470  1.979174 -1.198156 -1.187503
2013-01-04 -0.800364 -0.881625 -0.953806  1.514813
2013-01-05 -0.029213 -1.201884 -0.748515 -0.734079
2013-01-06  1.110286 -2.264249  1.585843  0.834465

In [6]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [8]:
# Viewing data 

df.head()

                   A         B         C         D
2013-01-01  0.788254  0.242065 -0.384205  0.204724
2013-01-02  0.079479  1.164236 -1.127307 -0.299012
2013-01-03  0.822470  1.979174 -1.198156 -1.187503
2013-01-04 -0.800364 -0.881625 -0.953806  1.514813
2013-01-05 -0.029213 -1.201884 -0.748515 -0.734079

In [9]:
df.tail(2)

                   A         B         C         D
2013-01-05 -0.029213 -1.201884 -0.748515 -0.734079
2013-01-06  1.110286 -2.264249  1.585843  0.834465

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [13]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.328485 -0.160380 -0.471024  0.055568
std    0.711459  1.582748  1.049547  1.005268
min   -0.800364 -2.264249 -1.198156 -1.187503
25%   -0.002040 -1.121819 -1.083932 -0.625312
50%    0.433866 -0.319780 -0.851161 -0.047144
75%    0.813916  0.933694 -0.475282  0.677029
max    1.110286  1.979174  1.585843  1.514813

In [14]:
df.head(1)

                   A         B         C         D
2013-01-01  0.788254  0.242065 -0.384205  0.204724

In [15]:
# Transposing your data 
df.transpose()

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.788254    0.079479    0.822470   -0.800364   -0.029213    1.110286
B    0.242065    1.164236    1.979174   -0.881625   -1.201884   -2.264249
C   -0.384205   -1.127307   -1.198156   -0.953806   -0.748515    1.585843
D    0.204724   -0.299012   -1.187503    1.514813   -0.734079    0.834465

In [16]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.204724 -0.384205  0.242065  0.788254
2013-01-02 -0.299012 -1.127307  1.164236  0.079479
2013-01-03 -1.187503 -1.198156  1.979174  0.822470
2013-01-04  1.514813 -0.953806 -0.881625 -0.800364
2013-01-05 -0.734079 -0.748515 -1.201884 -0.029213
2013-01-06  0.834465  1.585843 -2.264249  1.110286

df.sort_values(by="B", ascending=False)

##  Selection 
- DataFrame.at()
- DataFrame.iat()
- DataFrame.loc()
- DataFrame.iloc()

-

In [20]:
#fro a dataFreame  passing a ingsle lae lselcts a colums and yielda series  equivalent to df.a
df['A']

2013-01-01    0.788254
2013-01-02    0.079479
2013-01-03    0.822470
2013-01-04   -0.800364
2013-01-05   -0.029213
2013-01-06    1.110286
Freq: D, Name: A, dtype: float64

In [21]:
# for a Datafream , passing  a slice : selects mathcing ros  
df[0:3]

                   A         B         C         D
2013-01-01  0.788254  0.242065 -0.384205  0.204724
2013-01-02  0.079479  1.164236 -1.127307 -0.299012
2013-01-03  0.822470  1.979174 -1.198156 -1.187503

- Selection by label

In [23]:
# see more in Selection by Label using DataFrame.loc() or Datarame.at()

# Seleting a row matching aa label:  
df.loc[dates[0]]

A    0.788254
B    0.242065
C   -0.384205
D    0.204724
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  0.788254  0.242065
2013-01-02  0.079479  1.164236
2013-01-03  0.822470  1.979174
2013-01-04 -0.800364 -0.881625
2013-01-05 -0.029213 -1.201884
2013-01-06  1.110286 -2.264249

In [28]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  0.079479  1.164236
2013-01-03  0.822470  1.979174
2013-01-04 -0.800364 -0.881625

In [29]:
# selecing a single row ad column lable reutrens a scalar  
df.loc[dates[0], "A"]

np.float64(0.7882536367429013)

- boolean indexing

In [31]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-01  0.788254  0.242065 -0.384205  0.204724
2013-01-02  0.079479  1.164236 -1.127307 -0.299012
2013-01-03  0.822470  1.979174 -1.198156 -1.187503
2013-01-06  1.110286 -2.264249  1.585843  0.834465

In [32]:
# Selectign values from a DtaFrame where a boolean condition  condition is met
df[df > 0]

                   A         B         C         D
2013-01-01  0.788254  0.242065       NaN  0.204724
2013-01-02  0.079479  1.164236       NaN       NaN
2013-01-03  0.822470  1.979174       NaN       NaN
2013-01-04       NaN       NaN       NaN  1.514813
2013-01-05       NaN       NaN       NaN       NaN
2013-01-06  1.110286       NaN  1.585843  0.834465

In [34]:
# using isin() method for fillering 
df2 = df.copy() 
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01  0.788254  0.242065 -0.384205  0.204724    one
2013-01-02  0.079479  1.164236 -1.127307 -0.299012    one
2013-01-03  0.822470  1.979174 -1.198156 -1.187503    two
2013-01-04 -0.800364 -0.881625 -0.953806  1.514813  three
2013-01-05 -0.029213 -1.201884 -0.748515 -0.734079   four
2013-01-06  1.110286 -2.264249  1.585843  0.834465  three

In [35]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03  0.822470  1.979174 -1.198156 -1.187503   two
2013-01-05 -0.029213 -1.201884 -0.748515 -0.734079  four

In [37]:
# Setting  
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [39]:
df.at[dates[0], "A"] = 0 
df

                   A         B         C         D
2013-01-01  0.000000  0.242065 -0.384205  0.204724
2013-01-02  0.079479  1.164236 -1.127307 -0.299012
2013-01-03  0.822470  1.979174 -1.198156 -1.187503
2013-01-04 -0.800364 -0.881625 -0.953806  1.514813
2013-01-05 -0.029213 -1.201884 -0.748515 -0.734079
2013-01-06  1.110286 -2.264249  1.585843  0.834465

In [41]:
# setting values by position  
df.iat[0,1] = 0
df

                   A         B         C         D
2013-01-01  0.000000  0.000000 -0.384205  0.204724
2013-01-02  0.079479  1.164236 -1.127307 -0.299012
2013-01-03  0.822470  1.979174 -1.198156 -1.187503
2013-01-04 -0.800364 -0.881625 -0.953806  1.514813
2013-01-05 -0.029213 -1.201884 -0.748515 -0.734079
2013-01-06  1.110286 -2.264249  1.585843  0.834465

In [42]:
# settting by assing with a Numpy array  
df.loc[:, "D"] = np.array([5] * len(df))
df

                   A         B         C    D
2013-01-01  0.000000  0.000000 -0.384205  5.0
2013-01-02  0.079479  1.164236 -1.127307  5.0
2013-01-03  0.822470  1.979174 -1.198156  5.0
2013-01-04 -0.800364 -0.881625 -0.953806  5.0
2013-01-05 -0.029213 -1.201884 -0.748515  5.0
2013-01-06  1.110286 -2.264249  1.585843  5.0

In [ ]:
# a wheer operatino withsetgin

df2 = df.copy()
df2[df2 > 0] = -dl2
df2

                   A         B         C    D
2013-01-01  0.000000  0.000000 -0.384205 -5.0
2013-01-02 -0.079479 -1.164236 -1.127307 -5.0
2013-01-03 -0.822470 -1.979174 -1.198156 -5.0
2013-01-04 -0.800364 -0.881625 -0.953806 -5.0
2013-01-05 -0.029213 -1.201884 -0.748515 -5.0
2013-01-06 -1.110286 -2.264249 -1.585843 -5.0

## Missing Data
- for numpy data types , np.nanreqpresnts missing data. it is by default not inculde in comoputaions  
- - Reingdexing allow you to change   and delete te index on a specified axis. This returens

In [45]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])
df1

                   A         B         C    D   E
2013-01-01  0.000000  0.000000 -0.384205  5.0 NaN
2013-01-02  0.079479  1.164236 -1.127307  5.0 NaN
2013-01-03  0.822470  1.979174 -1.198156  5.0 NaN
2013-01-04 -0.800364 -0.881625 -0.953806  5.0 NaN

In [47]:
df1.loc[dates[0] : dates[1],"E"] =1 
df1

                   A         B         C    D    E
2013-01-01  0.000000  0.000000 -0.384205  5.0  1.0
2013-01-02  0.079479  1.164236 -1.127307  5.0  1.0
2013-01-03  0.822470  1.979174 -1.198156  5.0  NaN
2013-01-04 -0.800364 -0.881625 -0.953806  5.0  NaN

In [ ]:
#  DataFrame.dropnan()  
df1.dropna(how="any")

                   A         B         C    D    E
2013-01-01  0.000000  0.000000 -0.384205  5.0  1.0
2013-01-02  0.079479  1.164236 -1.127307  5.0  1.0

In [51]:
# fills missing data  dataFrame.fillna()  
df1.fillna(value=5)

                   A         B         C    D    E
2013-01-01  0.000000  0.000000 -0.384205  5.0  1.0
2013-01-02  0.079479  1.164236 -1.127307  5.0  1.0
2013-01-03  0.822470  1.979174 -1.198156  5.0  5.0
2013-01-04 -0.800364 -0.881625 -0.953806  5.0  5.0

##  Operations

In [54]:
# Stats   Operations in general exlude missing data.
# calculate the mean value fr each column 
df.mean()

A    0.197110
B   -0.200724
C   -0.471024
D    5.000000
dtype: float64

In [56]:
df.mean(axis=1)

2013-01-01    1.153949
2013-01-02    1.279102
2013-01-03    1.650872
2013-01-04    0.591051
2013-01-05    0.755097
2013-01-06    1.357970
Freq: D, dtype: float64

In [60]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

-  User defined functions

In [61]:
df.agg(lambda x: x.max() - x.min() * 5.6)

A     5.592322
B    14.658970
C     8.295514
D   -23.000000
dtype: float64

In [62]:
df.transform(lambda x: x * 5.6)

                   A          B         C     D
2013-01-01  0.000000   0.000000 -2.151546  28.0
2013-01-02  0.445082   6.519724 -6.312917  28.0
2013-01-03  4.605829  11.083376 -6.709671  28.0
2013-01-04 -4.482037  -4.937098 -5.341316  28.0
2013-01-05 -0.163591  -6.730549 -4.191684  28.0
2013-01-06  6.217599 -12.679796  8.880719  28.0

## Value Couns

In [67]:
s = pd.DataFrame(np.random.randint(0, 7 ,size=40))
s.head(5)

   0
0  5
1  4
2  5
3  5
4  5

In [68]:
s.value_counts()

0
5    14
2     8
6     6
4     4
1     4
3     3
0     1
Name: count, dtype: int64

## Straing Methos 
- s Serises is quippedn with a set of sting processing methods in the `strt` attribuilte that make it to easy to operat on each element  of  array 
-

In [69]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])

In [71]:
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

In [72]:
s.str.upper()

0       A
1       B
2       C
3    AABA
4    BACA
5     NaN
6    CABA
7     DOG
8     CAT
dtype: object

## Merge 
-  Concat :a pandas provides  sseries and DataFrame  objects various kinds of set logic for the indexes and relationa algebra functionlity in the case of join  or  merge-type operations.

-  Concatenating pandase objects togerther row-wise with `concat()`

In [79]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.914337 -0.380942  0.231998 -1.540526
1 -1.286708 -0.405071  0.743448  1.216859
2 -0.143133 -1.663832  1.534792  0.028764
3 -0.898799 -1.507540 -0.406610 -0.826426
4  0.257206 -0.908522 -0.769893  0.430646
5  0.494105  0.269456  1.322046 -0.221286
6  0.395985  0.480180  0.774840 -1.478920
7 -0.399826  1.780593  0.579304 -1.523168
8  0.460404 -0.063878 -1.904430  2.895543
9 -0.097168  0.315937 -0.389768  1.502375

In [80]:
# create a new DataFrame Pieces 
pieces = [df[:3], df[3:7], df[7:]] 
pieces

[          0         1         2         3
 0 -0.914337 -0.380942  0.231998 -1.540526
 1 -1.286708 -0.405071  0.743448  1.216859
 2 -0.143133 -1.663832  1.534792  0.028764,
           0         1         2         3
 3 -0.898799 -1.507540 -0.406610 -0.826426
 4  0.257206 -0.908522 -0.769893  0.430646
 5  0.494105  0.269456  1.322046 -0.221286
 6  0.395985  0.480180  0.774840 -1.478920,
           0         1         2         3
 7 -0.399826  1.780593  0.579304 -1.523168
 8  0.460404 -0.063878 -1.904430  2.895543
 9 -0.097168  0.315937 -0.389768  1.502375]

In [81]:
pd.concat(pieces)

          0         1         2         3
0 -0.914337 -0.380942  0.231998 -1.540526
1 -1.286708 -0.405071  0.743448  1.216859
2 -0.143133 -1.663832  1.534792  0.028764
3 -0.898799 -1.507540 -0.406610 -0.826426
4  0.257206 -0.908522 -0.769893  0.430646
5  0.494105  0.269456  1.322046 -0.221286
6  0.395985  0.480180  0.774840 -1.478920
7 -0.399826  1.780593  0.579304 -1.523168
8  0.460404 -0.063878 -1.904430  2.895543
9 -0.097168  0.315937 -0.389768  1.502375

## Join
- `merge()` enablesSQL Style Join types along specific  columns or indexes.

In [83]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [85]:
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [86]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

- `Merge()`  on unique keys

In [90]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
left

   key  lval
0  foo     1
1  bar     2

In [92]:
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})
right

   key  rval
0  foo     4
1  bar     5

In [94]:
# merage two DataFrames using multiple keys 
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  bar     2     5

# Grouping
- By "group by " we are referring to a property  on ro more of the following steps  steps  
- *Splitting* the data into gropus base on some criteria  
- *Applying* : function to each group indepencdently 
- *Combining* the results into a data structure

In [97]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)
df

     A      B         C         D
0  foo    one  0.430177 -0.066683
1  bar    one  0.023542 -0.651689
2  foo    two  1.343913  0.559823
3  bar  three  0.045847  0.503332
4  foo    two  0.748821  0.554614
5  bar    two  0.159852 -0.213204
6  foo    one  0.717893  0.193603
7  foo  three -0.128202  0.701729

In [98]:
df.groupby("A")[["C"]].sum()

            C
A
bar  0.229241
foo  3.112602